12/data/attachments/372edb681982f71d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shaun_force_Friend_34593_1</nif:username>
            <nif:friendToBeRequested>soap_friends_30227e46-c1fd-41dc-9412-4d1f0c3bbc5f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>